app/services/transacoes_service.rb

	def processa
		ActiveRecord::Base.transaction do
			loja = Loja.find_by(nome: @detalhes_transacao[:nome_loja])
			unless loja
				loja = Loja.new(
					nome: @detalhes_transacao[:nome_loja],
					nome_representante: @detalhes_transacao[:nome_representante]
				)
				loja.save!
			end
			tipo_transacao = TipoTransacao.find(@detalhes_transacao[:tipo])
			data_hora = converte_data
			transacao = Transacao.new(
				data_hora: data_hora,
				valor: @detalhes_transacao[:valor],
				cpf_beneficiario: @detalhes_transacao[:cpf],
				cartao: @detalhes_transacao[:cartao],
				loja: loja,
				tipo_transacao: tipo_transacao)
			transacao.save!
---
SELECT `lojas`.* FROM `lojas` WHERE `lojas`.`nome` = ' BAR DO JOÃO      ' LIMIT 1
INSERT INTO `lojas` (`nome`, `nome_representante`, `created_at`, `updated_at`) VALUES (' BAR DO JOÃO      ', 'JOÃO MACEDO  ', '2020-09-09 04:09:38.513283', '2020-09-09 04:09:38.513283')
SELECT `tipo_transacaos`.* FROM `tipo_transacaos` WHERE `tipo_transacaos`.`id` = 3 LIMIT 1
INSERT INTO `transacaos` (`data_hora`, `valor`, `cpf_beneficiario`, `cartao`, `loja_id`, `tipo_transacao_id`, `created_at`, `updated_at`) VALUES ('2019-03-01 15:34:53', 1.0, '09620676017', '4753****3153', 19, 3, '2020-09-09 04:09:38.566686', '2020-09-09 04:09:38.566686')