app/helpers/sessoes_helper.rb

  def current_user
    @current_user ||= Usuario.find_by(id: session[:estagiario_id])
---
SELECT `usuarios`.* FROM `usuarios` WHERE `usuarios`.`id` IS NULL LIMIT 1