app/controllers/sessoes_controller.rb

  def create
  	usuario = Usuario.find_by(user: params[:session][:user])
---
SELECT `usuarios`.* FROM `usuarios` WHERE `usuarios`.`user` = 'oathosassis' LIMIT 1