app/controllers/stores_controller.rb

SELECT `transactions`.* FROM `transactions` WHERE `transactions`.`store_id` = 56
---
  def transactions
    @transactions = Transaction.where(store_id: params[:id])