app/controllers/stores_controller.rb

  def index
    @stores = Store.all
---
SELECT `stores`.* FROM `stores`

  def set_store
    @store = Store.find(params[:id])
---
SELECT  `stores`.* FROM `stores` WHERE `stores`.`id` = 56 LIMIT 1