app/controllers/transacoes_controller.rb

	def index
		@ultimas_transacoes = Transacao.limit(5)
---
SELECT `transacaos`.* FROM `transacaos` LIMIT 5

	def mostrar_transacoes
		@lojas = Loja.all
		if params[:loja].present?
			@loja = Loja.find(params[:loja])
		else
			@loja = @lojas.first
		end
		@transacoes = Transacao.where(loja: @loja)
---
SELECT `lojas`.* FROM `lojas` ORDER BY `lojas`.`id` ASC LIMIT 1
SELECT `lojas`.* FROM `lojas` WHERE `lojas`.`id` = 47 LIMIT 1
SELECT `transacaos`.* FROM `transacaos` WHERE `transacaos`.`loja_id` = 45 LIMIT 11