app/controllers/transactions_controller.rb

  def index
    @companies = Company.all.includes(:transactions)
---
SELECT `transactions`.* FROM `transactions`

  def create
    file = File.open(params.permit(:file)[:file])
    content = file.readlines.map(&:chomp)
    content.each do |line|
      extracted_params = InputFormatter.new(line).extract_infos
      company = get_company(extracted_params[:company])
      new_transaction = company.transactions.build(extracted_params[:transaction])
      new_transaction.save
---
INSERT INTO `transactions` (`store_id`, `kind`, `date_and_hour`, `value`, `cpf`, `card_number`, `created_at`, `updated_at`) VALUES (41, 3, '2019-03-01 18:34:53', 142, '09620676017', '4753****3153', '2020-10-01 03:21:44', '2020-10-01 03:21:44')