app/controllers/usuarios_controller.rb

INSERT INTO `usuarios` (`nome`, `cpf`, `email`, `celular`, `user`, `password_digest`, `created_at`, `updated_at`) VALUES ('Athos', '125.410.186-14', 'athos.c.assis@gmail.com', '(31)99465-9086', 'oathosassis', '$2a$12$K0c5XQEq7rZBRLA3tBd2muJQczMlEd0BwdIBo0g5exjy/x57fe2gG', '2020-09-05 18:55:28.208861', '2020-09-05 18:55:28.208861')
---
  def create
  	@usuario = Usuario.new(usuario_params)
  	if @usuario.save

SELECT `usuarios`.* FROM `usuarios` WHERE `usuarios`.`id` = 1 LIMIT 1
---
  def edit
    @usuario = Usuario.find(params[:id])