app/views/transactions/index.html.erb

SELECT `transactions`.* FROM `transactions`
---
        </tr>
        <% company.transactions.each do |transaction| %>